#### Task: Library Management System SQL Queries

Objective: Create a series of SQL queries to analyze the library's data effectively.

Requirements:

1. Database Structure: You need to create tables for the following entities:

Books: Includes BookID, Title, Author, ISBN, PublishedYear, CategoryID, and AvailableCopies.

Categories: Includes CategoryID and CategoryName.

Members: Includes MemberID, Name, Email, and JoinDate.

Loans: Includes LoanID, BookID, MemberID, LoanDate, and ReturnDate.



2. Sample Data: Populate each table with at least 20 records. Ensure that:

Each book belongs to a category.

Each loan corresponds to a valid book and member.



3. Complex Queries: Write SQL queries to accomplish the following:

List all books along with their category names and the number of available copies.

Find out which member has borrowed the most books and how many books they have borrowed.

Calculate the average loan duration for books in each category.

Identify the top 5 most borrowed books and how many times each has been borrowed.

Generate a report showing all loans that are overdue, including the member's name and book title.




Steps to Follow:

1. Create Tables: Write SQL statements to create the tables described above.


2. Insert Sample Data: Populate each table with a mix of data to allow for meaningful queries.


3. Write Queries: For each of the complex queries listed, write a corresponding SQL statement to retrieve the required information.



Challenge:

Use subqueries where appropriate.

Implement JOIN operations to combine data from multiple tables.

Ensure your queries handle NULL values correctly, especially when dealing with optional data (like return dates).


Feel free to ask for specific guidance on any of these tasks or if you need help with writing the SQL statements!

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:password@localhost:3306/library

'Connected: root@library'

In [3]:
%sql SHOW TABLES

 * mysql+pymysql://root:***@localhost:3306/library
4 rows affected.

[('books',), ('categories',), ('loans',), ('members',)]

In [9]:
%%sql
SELECT * FROM loans;

 * mysql+pymysql://root:***@localhost:3306/library
5 rows affected.

[(1, 1, 1, datetime.date(2024, 9, 1), None),
 (2, 2, 2, datetime.date(2024, 7, 12), datetime.date(2024, 7, 22)),
 (3, 3, 3, datetime.date(2024, 6, 11), None),
 (4, 4, 4, datetime.date(2024, 8, 21), datetime.date(2024, 8, 30)),
 (5, 5, 5, datetime.date(2024, 9, 5), None)]

In [5]:
%%sql
-- List all books along with their category names and the number of available copies.
SELECT Title, CategoryName, AvailableCopies FROM categories
JOIN books 
ON books.categoryid = categories.categoryid;

 * mysql+pymysql://root:***@localhost:3306/library
5 rows affected.

[('The Great Gatsby', 'Fiction', 5),
 ('Sapiens: A Brief History of Humankind', 'Non-Fiction', 3),
 ('The Origin of Species', 'Science', 2),
 ('Clean Code', 'Technology', 7),
 ('A Brief History of Time', 'Science', 4)]

In [11]:
%%sql
-- Find out which member has borrowed the most books and how many books they have borrowed.
SELECT 
    Name, Email, count(loans.bookid) BooksBorrowed
FROM members
JOIN loans 
ON loans.memberid = members.memberid
JOIN books 
ON books.bookid = loans.bookid
GROUP BY Name, Email;

 * mysql+pymysql://root:***@localhost:3306/library
5 rows affected.

[('John Doe', 'johndoe@example.com', 1),
 ('Jane Smith', 'janesmith@example.com', 1),
 ('Sam Brown', 'sambrown@example.com', 1),
 ('Lisa Johnson', 'lisajohnson@example.com', 1),
 ('Mike Davis', 'mikedavis@example.com', 1)]

In [7]:
%sql SELECT * FROM members

 * mysql+pymysql://root:***@localhost:3306/library
5 rows affected.

[(1, 'John Doe', 'johndoe@example.com', datetime.date(2023, 5, 15)),
 (2, 'Jane Smith', 'janesmith@example.com', datetime.date(2022, 10, 10)),
 (3, 'Sam Brown', 'sambrown@example.com', datetime.date(2021, 7, 21)),
 (4, 'Lisa Johnson', 'lisajohnson@example.com', datetime.date(2020, 1, 25)),
 (5, 'Mike Davis', 'mikedavis@example.com', datetime.date(2024, 3, 2))]

In [10]:
%sql SELECT * FROM books LIMIT 1

 * mysql+pymysql://root:***@localhost:3306/library
1 rows affected.

[(1, 'The Great Gatsby', 'F. Scott Fitzgerald', '9780743273565', 1925, 1, 5)]

In [42]:
%%sql 
-- Calculate the average loan duration for books in each category.
SELECT 
    CategoryName,
    ROUND(AVG(CASE 
        WHEN 
            ReturnDate IS NULL THEN DATEDIFF(CURDATE(), LoanDate)
            ELSE DATEDIFF(ReturnDate, LoanDate) END), 2) DateDiff
FROM loans 
JOIN books
ON loans.bookid = books.bookid
JOIN categories
ON books.categoryid = categories.categoryid
group by CategoryName

 * mysql+pymysql://root:***@localhost:3306/library
4 rows affected.

[('Fiction', Decimal('37.00')),
 ('Non-Fiction', Decimal('10.00')),
 ('Science', Decimal('76.00')),
 ('Technology', Decimal('9.00'))]